{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 57,
   "metadata": {},
   "outputs": [],
   "source": [
    "import kuzu\n",
    "import pandas as pd\n",
    "import numpy as np\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize database\n",
    "db = kuzu.Database(\"./knowledge_graph\")\n",
    "conn = kuzu.Connection(db)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc73f92060>"
      ]
     },
     "execution_count": 59,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Entity Table Creation\n",
    "conn.execute(\"\"\"\n",
    "CREATE NODE TABLE Entity(\n",
    "    entity_id STRING,\n",
    "    description STRING,\n",
    "    entity_properties STRING[],\n",
    "    PRIMARY KEY(entity_id)\n",
    ")\"\"\")\n",
    "\n",
    "# Metrics Table Creation\n",
    "conn.execute(\"\"\"\n",
    "CREATE NODE TABLE Metrics(\n",
    "    metric_id STRING,\n",
    "    metric_name STRING,\n",
    "    cur_value DOUBLE,\n",
    "    change DOUBLE,\n",
    "    trend DOUBLE[],\n",
    "    goal STRING,\n",
    "    PRIMARY KEY(metric_id)\n",
    ")\"\"\")\n",
    "\n",
    "# Dimensions Table Creation\n",
    "conn.execute(\"\"\"\n",
    "CREATE NODE TABLE Dimensions(\n",
    "    dimension_id STRING,\n",
    "    dimension_name STRING,\n",
    "    dimension_values STRING[],\n",
    "    dimension_description STRING,\n",
    "    PRIMARY KEY(dimension_id)\n",
    ")\"\"\")\n",
    "\n",
    "#User Table Creation\n",
    "conn.execute(\"\"\"\n",
    "CREATE NODE TABLE User(\n",
    "    user_id STRING,\n",
    "    user_name STRING,\n",
    "    user_domain STRING,\n",
    "    user_theme STRING,\n",
    "    PRIMARY KEY(user_id)\n",
    ")\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc8748f650>"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Relationships\n",
    "conn.execute(\"CREATE REL TABLE Relates_to(FROM Entity To Entity)\")\n",
    "conn.execute(\"CREATE REL TABLE Belongs_to(FROM Dimensions to Entity)\")\n",
    "conn.execute(\"CREATE REL TABLE Has_Metrics(FROM Entity TO Metrics)\")\n",
    "conn.execute(\"CREATE REL TABLE Impacts(FROM Metrics TO Metrics, relationship STRING, strength STRING)\")\n",
    "conn.execute(\"CREATE REL TABLE Drives(FROM Dimensions TO Metrics, relationship STRING, strength STRING)\")\n",
    "conn.execute(\"CREATE REL TABLE Similar_to(FROM User TO User, similarity_strength STRING)\")\n",
    "conn.execute(\"CREATE REL TABLE Associated(FROM User TO Metrics, Relationship STRING)\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc728ee9f0>"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Adding entities\n",
    "conn.execute(\"COPY Entity FROM 'entity.csv'\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between Customer and Sales.\n",
      "\n",
      "Relationships have been created between Sales and Product.\n",
      "\n",
      "Relationships have been created between Supplier and Product.\n",
      "\n",
      "Relationships have been created between Product and Warehouse.\n",
      "\n",
      "Relationships have been created between Product and Return.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between entities\n",
    "conn.execute(\"\"\"\n",
    "MATCH (e1:Entity {entity_id: 'CUSTOMER'}), (e2:Entity {entity_id: 'SALES'})\n",
    "CREATE (e1)-[:Relates_to]->(e2)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between Customer and Sales.\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (e1:Entity {entity_id: 'SALES'}), (e2:Entity {entity_id: 'PRODUCT'})\n",
    "CREATE (e1)-[:Relates_to]->(e2)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between Sales and Product.\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (e1:Entity {entity_id: 'SUPPLIER'}), (e2:Entity {entity_id: 'PRODUCT'})\n",
    "CREATE (e1)-[:Relates_to]->(e2)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between Supplier and Product.\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (e1:Entity {entity_id: 'PRODUCT'}), (e2:Entity {entity_id: 'WAREHOUSE'})\n",
    "CREATE (e1)-[:Relates_to]->(e2)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between Product and Warehouse.\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (e1:Entity {entity_id: 'PRODUCT'}), (e2:Entity {entity_id: 'RETURN'})\n",
    "CREATE (e1)-[:Relates_to]->(e2)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between Product and Return.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc729cf5f0>"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Adding metrics\n",
    "conn.execute(\"COPY Metrics FROM 'metrics.csv'\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between Customer and Metrics.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between Customer and Metrics\n",
    "conn.execute(\"\"\"\n",
    "MATCH (c:Entity {entity_id: 'CUSTOMER'}), (m:Metrics {metric_id: 'CLTV'})\n",
    "CREATE (c)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (c:Entity {entity_id: 'CUSTOMER'}), (m:Metrics {metric_id: 'ActiveCustomers'})\n",
    "CREATE (c)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (c:Entity {entity_id: 'CUSTOMER'}), (m:Metrics {metric_id: 'ChurnRiskScore'})\n",
    "CREATE (c)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between Customer and Metrics.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between Product and Metrics.\n"
     ]
    }
   ],
   "source": [
    "# Creating relationships between Product and Metrics\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (p:Entity {entity_id: 'PRODUCT'}), (m:Metrics {metric_id: 'BackOrderRatio'})\n",
    "CREATE (p)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between Product and Metrics.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between SALES and Metrics.\n"
     ]
    }
   ],
   "source": [
    "# Creating relationships between SALES and Metrics\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'SALES'}), (m:Metrics {metric_id: 'AOV'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'SALES'}), (m:Metrics {metric_id: 'Revenue'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'SALES'}), (m:Metrics {metric_id: 'PurchaseFrequency'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'SALES'}), (m:Metrics {metric_id: 'Recency'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between SALES and Metrics.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between WAREHOUSE and Metrics.\n"
     ]
    }
   ],
   "source": [
    "# Creating relationships between Warehouse and Metrics\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'WAREHOUSE'}), (m:Metrics {metric_id: 'StockoutRate'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'WAREHOUSE'}), (m:Metrics {metric_id: 'AvgDeliveryVolume'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'WAREHOUSE'}), (m:Metrics {metric_id: 'AvgDeliveryCost'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between WAREHOUSE and Metrics.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between WAREHOUSE and Metrics.\n"
     ]
    }
   ],
   "source": [
    "# Creating relationships between Return and Metrics\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'RETURN'}), (m:Metrics {metric_id: 'ReturnRate'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "conn.execute(\"\"\"\n",
    "MATCH (o:Entity {entity_id: 'RETURN'}), (m:Metrics {metric_id: 'AvgReturnAmt'})\n",
    "CREATE (o)-[:Has_Metrics]->(m)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between WAREHOUSE and Metrics.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc727367b0>"
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Adding dimensions\n",
    "conn.execute(\"COPY Dimensions FROM 'dimensions.csv'\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between Dimensions and Customer.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between Dimensions and Customer \n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'Segment'}),(c:Entity {Entity_id: 'CUSTOMER'})\n",
    "CREATE (d)-[:Belongs_to]->(c)\n",
    "\"\"\")\n",
    "conn.execute(\"\"\"\n",
    "MATCH(d:Dimensions {dimension_id: 'Gender'}),(c:Entity {Entity_id: 'CUSTOMER'})\n",
    "CREATE (d)-[:Belongs_to]->(c)\n",
    "\"\"\")\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'AgeGroup'}),(c:Entity {Entity_id: 'CUSTOMER'})\n",
    "CREATE (d)-[:Belongs_to]->(c)\n",
    "\"\"\")\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'IncomeBracket'}),(c:Entity {Entity_id: 'CUSTOMER'})\n",
    "CREATE (d)-[:Belongs_to]->(c)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between Dimensions and Customer.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between Product and Dimensions.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between Product and Dimensions\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'ProductSubcategory'}), (p:Entity{entity_id: 'PRODUCT'})\n",
    "CREATE (d)-[Belongs_to]->(p)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'ProductCategory'}), (p:Entity{entity_id: 'PRODUCT'})\n",
    "CREATE (d)-[Belongs_to]->(p)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH  (d:Dimensions {dimension_id: 'Color'}), (p:Entity{entity_id: 'PRODUCT'})\n",
    "CREATE (d)-[Belongs_to]->(p)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH  (d:Dimensions {dimension_id: 'Size'}), (p:Entity{entity_id: 'PRODUCT'})          \n",
    "CREATE (d)-[Belongs_to]->(p)\n",
    "\"\"\")\n",
    "\n",
    "print(\"\\nRelationships have been created between Product and Dimensions.\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between SALES and Dimensions.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between SALES and SALES_Dimensions\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'Region'}), (s:Entity{entity_id: 'SALES'})\n",
    "CREATE (d)-[Belongs_to]->(s)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'SalesDate'}), (s:Entity{entity_id: 'SALES'})\n",
    "CREATE (d)-[Belongs_to]->(s)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'PaymentType'}), (s:Entity{entity_id: 'SALES'})\n",
    "CREATE (d)-[Belongs_to]->(s)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between SALES and Dimensions.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between SUPPLIER and Dimensions.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between Supplier and SALES_Dimensions\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'SupplierCountry'}), (s:Entity{entity_id: 'SUPPLIER'})\n",
    "CREATE (d)-[Belongs_to]->(s)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'SupplierName'}), (s:Entity{entity_id: 'SUPPLIER'})\n",
    "CREATE (d)-[Belongs_to]->(s)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between SUPPLIER and Dimensions.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Relationships have been created between Warehouse and Dimensions.\n"
     ]
    }
   ],
   "source": [
    "# Creating the relationships between Warehouse and SALES_Dimensions\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'WarehouseLocation'}), (w:Entity{entity_id: 'WAREHOUSE'})\n",
    "CREATE (d)-[Belongs_to]->(w)\n",
    "\"\"\")\n",
    "\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'StorageSection'}), (w:Entity{entity_id: 'WAREHOUSE'})\n",
    "CREATE (d)-[Belongs_to]->(w)\n",
    "\"\"\")\n",
    "print(\"\\nRelationships have been created between Warehouse and Dimensions.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc7f55f410>"
      ]
     },
     "execution_count": 75,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Creating the relationships between Warehouse and Dimensions\n",
    "conn.execute(\"\"\"\n",
    "MATCH (d:Dimensions {dimension_id: 'ReturnDate'}), (r:Entity{entity_id: 'RETURN'})\n",
    "CREATE (d)-[Belongs_to]->(r)\n",
    "\"\"\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc729cf860>"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.execute('COPY Impacts FROM \"impacts.csv\"')\n",
    "conn.execute('COPY Drives FROM \"drives.csv\"')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<kuzu.query_result.QueryResult at 0x72cc728ec350>"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.execute(\"COPY User FROM 'user.csv'\")\n",
    "conn.execute(\"COPY Similar_to FROM 'similar_to.csv'\")\n",
    "conn.execute('COPY Associated FROM \"associated.csv\"')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>e.entity_id</th>\n",
       "      <th>e.description</th>\n",
       "      <th>e.entity_properties</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CUSTOMER</td>\n",
       "      <td>Customer Entity</td>\n",
       "      <td>['Some Properties']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>Product Entity</td>\n",
       "      <td>['Some Properties']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SALES</td>\n",
       "      <td>Sales Entity</td>\n",
       "      <td>['Some Properties']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>RETURN</td>\n",
       "      <td>Returns Entity</td>\n",
       "      <td>['Some Properties']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SUPPLIER</td>\n",
       "      <td>Supplier Entity</td>\n",
       "      <td>['Some Properties']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>WAREHOUSE</td>\n",
       "      <td>Warehouse Entity</td>\n",
       "      <td>['Some Properties']</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  e.entity_id      e.description  e.entity_properties\n",
       "0    CUSTOMER    Customer Entity  ['Some Properties']\n",
       "1     PRODUCT     Product Entity  ['Some Properties']\n",
       "2       SALES       Sales Entity  ['Some Properties']\n",
       "3      RETURN     Returns Entity  ['Some Properties']\n",
       "4    SUPPLIER    Supplier Entity  ['Some Properties']\n",
       "5   WAREHOUSE   Warehouse Entity  ['Some Properties']"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (e:Entity) RETURN e.entity_id, e.description, e.entity_properties LIMIT 10;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>m.metric_id</th>\n",
       "      <th>m.metric_name</th>\n",
       "      <th>m.cur_value</th>\n",
       "      <th>m.change</th>\n",
       "      <th>m.trend</th>\n",
       "      <th>m.goal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CLTV</td>\n",
       "      <td>CLTV</td>\n",
       "      <td>1500.00</td>\n",
       "      <td>5.00</td>\n",
       "      <td>[1200.0, 1250.0, 1300.0, 1350.0, 1400.0, 1450....</td>\n",
       "      <td>Increase CLTV by 10%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>4.50</td>\n",
       "      <td>2.20</td>\n",
       "      <td>[3.0, 3.5, 4.0, 4.2, 4.3, 4.4, 4.5, 4.6, 4.6, ...</td>\n",
       "      <td>Increase purchase frequency by 1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>0.12</td>\n",
       "      <td>-1.50</td>\n",
       "      <td>[0.15, 0.14, 0.13, 0.12, 0.11, 0.11, 0.12, 0.1...</td>\n",
       "      <td>Reduce churn risk below 10%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ActiveCustomers</td>\n",
       "      <td>ActiveCustomers</td>\n",
       "      <td>1200.00</td>\n",
       "      <td>100.00</td>\n",
       "      <td>[1100.0, 1120.0, 1130.0, 1150.0, 1180.0, 1200....</td>\n",
       "      <td>Increase active customers by 10%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BackOrderRatio</td>\n",
       "      <td>BackOrder Ratio</td>\n",
       "      <td>0.08</td>\n",
       "      <td>-1.50</td>\n",
       "      <td>[0.12, 0.1, 0.09, 0.08, 0.07, 0.08, 0.09, 0.1,...</td>\n",
       "      <td>Reduce back order rate below 5%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>AOV</td>\n",
       "      <td>AOV</td>\n",
       "      <td>135.80</td>\n",
       "      <td>12.80</td>\n",
       "      <td>[100.0, 105.0, 110.0, 115.0, 120.0, 125.0, 130...</td>\n",
       "      <td>Increase AOV by 10%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Revenue</td>\n",
       "      <td>Revenue</td>\n",
       "      <td>500000.00</td>\n",
       "      <td>10000.00</td>\n",
       "      <td>[450000.0, 460000.0, 470000.0, 480000.0, 49000...</td>\n",
       "      <td>Increase revenue by 2%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>StockoutRate</td>\n",
       "      <td>Stockout Rate</td>\n",
       "      <td>0.05</td>\n",
       "      <td>-0.02</td>\n",
       "      <td>[0.08, 0.07, 0.06, 0.06, 0.05, 0.05, 0.05, 0.0...</td>\n",
       "      <td>Reduce stockout rate below 5%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>AvgReturnAmt</td>\n",
       "      <td>AverageReturnAmount</td>\n",
       "      <td>50.00</td>\n",
       "      <td>-5.00</td>\n",
       "      <td>[55.0, 54.0, 53.0, 52.0, 51.0, 50.0, 49.0, 48....</td>\n",
       "      <td>Reduce average return amount by 10%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ReturnRate</td>\n",
       "      <td>ReturnRate</td>\n",
       "      <td>0.10</td>\n",
       "      <td>-3.30</td>\n",
       "      <td>[0.15, 0.14, 0.13, 0.13, 0.12, 0.12, 0.11, 0.1...</td>\n",
       "      <td>Reduce return rate below 10%</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         m.metric_id        m.metric_name  m.cur_value  m.change  \\\n",
       "0               CLTV                 CLTV      1500.00      5.00   \n",
       "1  PurchaseFrequency    PurchaseFrequency         4.50      2.20   \n",
       "2     ChurnRiskScore       ChurnRiskScore         0.12     -1.50   \n",
       "3    ActiveCustomers      ActiveCustomers      1200.00    100.00   \n",
       "4     BackOrderRatio      BackOrder Ratio         0.08     -1.50   \n",
       "5                AOV                  AOV       135.80     12.80   \n",
       "6            Revenue              Revenue    500000.00  10000.00   \n",
       "7       StockoutRate        Stockout Rate         0.05     -0.02   \n",
       "8       AvgReturnAmt  AverageReturnAmount        50.00     -5.00   \n",
       "9         ReturnRate           ReturnRate         0.10     -3.30   \n",
       "\n",
       "                                             m.trend  \\\n",
       "0  [1200.0, 1250.0, 1300.0, 1350.0, 1400.0, 1450....   \n",
       "1  [3.0, 3.5, 4.0, 4.2, 4.3, 4.4, 4.5, 4.6, 4.6, ...   \n",
       "2  [0.15, 0.14, 0.13, 0.12, 0.11, 0.11, 0.12, 0.1...   \n",
       "3  [1100.0, 1120.0, 1130.0, 1150.0, 1180.0, 1200....   \n",
       "4  [0.12, 0.1, 0.09, 0.08, 0.07, 0.08, 0.09, 0.1,...   \n",
       "5  [100.0, 105.0, 110.0, 115.0, 120.0, 125.0, 130...   \n",
       "6  [450000.0, 460000.0, 470000.0, 480000.0, 49000...   \n",
       "7  [0.08, 0.07, 0.06, 0.06, 0.05, 0.05, 0.05, 0.0...   \n",
       "8  [55.0, 54.0, 53.0, 52.0, 51.0, 50.0, 49.0, 48....   \n",
       "9  [0.15, 0.14, 0.13, 0.13, 0.12, 0.12, 0.11, 0.1...   \n",
       "\n",
       "                                m.goal  \n",
       "0                 Increase CLTV by 10%  \n",
       "1     Increase purchase frequency by 1  \n",
       "2          Reduce churn risk below 10%  \n",
       "3     Increase active customers by 10%  \n",
       "4      Reduce back order rate below 5%  \n",
       "5                  Increase AOV by 10%  \n",
       "6               Increase revenue by 2%  \n",
       "7        Reduce stockout rate below 5%  \n",
       "8  Reduce average return amount by 10%  \n",
       "9         Reduce return rate below 10%  "
      ]
     },
     "execution_count": 79,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (m:Metrics) RETURN m.metric_id, m.metric_name, m.cur_value, m.change, m.trend, m.goal LIMIT 10;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>d.dimension_id</th>\n",
       "      <th>d.dimension_name</th>\n",
       "      <th>d.dimension_values</th>\n",
       "      <th>d.dimension_description</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Region</td>\n",
       "      <td>Region</td>\n",
       "      <td>['Northwest', 'Northeast', 'Midwest', 'South',...</td>\n",
       "      <td>Regions where customers are located</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SalesDate</td>\n",
       "      <td>SalesDate</td>\n",
       "      <td>['2023-11-05', '2023-07-21', '2022-12-15', '20...</td>\n",
       "      <td>Date of Order</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>PaymentType</td>\n",
       "      <td>PaymentType</td>\n",
       "      <td>['Credit Card', 'Cash', 'Check', 'Online']</td>\n",
       "      <td>Mode of Payment</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Color</td>\n",
       "      <td>Color</td>\n",
       "      <td>['Silver', 'Black', 'Red', 'Blue', 'White']</td>\n",
       "      <td>Available colors of the product</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ProductCategory</td>\n",
       "      <td>ProductCategory</td>\n",
       "      <td>['Bikes', 'Components', 'Clothing', 'Accessori...</td>\n",
       "      <td>Broad categories of products</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ProductSubcategory</td>\n",
       "      <td>ProductSubcategory</td>\n",
       "      <td>['Mountain Bikes', 'Road Bikes', 'Hybrid Bikes...</td>\n",
       "      <td>Subcategories under product category</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Size</td>\n",
       "      <td>Size</td>\n",
       "      <td>['Small', 'Medium', 'Large', 'Extra Large', 'X...</td>\n",
       "      <td>Available sizes for products</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>SupplierCountry</td>\n",
       "      <td>SupplierCountry</td>\n",
       "      <td>['USA', 'Canada', 'Germany', 'Japan', 'China']</td>\n",
       "      <td>Countries of product suppliers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>SupplierName</td>\n",
       "      <td>SupplierName</td>\n",
       "      <td>['ACME Supplies', 'Global Parts Inc.', 'Qualit...</td>\n",
       "      <td>Names of product suppliers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Segment</td>\n",
       "      <td>Customer Segment</td>\n",
       "      <td>['Individual', 'Corporate']</td>\n",
       "      <td>Type of customer (Individual or Corporate)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       d.dimension_id    d.dimension_name  \\\n",
       "0              Region              Region   \n",
       "1           SalesDate           SalesDate   \n",
       "2         PaymentType         PaymentType   \n",
       "3               Color               Color   \n",
       "4     ProductCategory     ProductCategory   \n",
       "5  ProductSubcategory  ProductSubcategory   \n",
       "6                Size                Size   \n",
       "7     SupplierCountry     SupplierCountry   \n",
       "8        SupplierName        SupplierName   \n",
       "9             Segment    Customer Segment   \n",
       "\n",
       "                                  d.dimension_values  \\\n",
       "0  ['Northwest', 'Northeast', 'Midwest', 'South',...   \n",
       "1  ['2023-11-05', '2023-07-21', '2022-12-15', '20...   \n",
       "2         ['Credit Card', 'Cash', 'Check', 'Online']   \n",
       "3        ['Silver', 'Black', 'Red', 'Blue', 'White']   \n",
       "4  ['Bikes', 'Components', 'Clothing', 'Accessori...   \n",
       "5  ['Mountain Bikes', 'Road Bikes', 'Hybrid Bikes...   \n",
       "6  ['Small', 'Medium', 'Large', 'Extra Large', 'X...   \n",
       "7     ['USA', 'Canada', 'Germany', 'Japan', 'China']   \n",
       "8  ['ACME Supplies', 'Global Parts Inc.', 'Qualit...   \n",
       "9                        ['Individual', 'Corporate']   \n",
       "\n",
       "                      d.dimension_description  \n",
       "0         Regions where customers are located  \n",
       "1                               Date of Order  \n",
       "2                             Mode of Payment  \n",
       "3             Available colors of the product  \n",
       "4                Broad categories of products  \n",
       "5        Subcategories under product category  \n",
       "6                Available sizes for products  \n",
       "7              Countries of product suppliers  \n",
       "8                  Names of product suppliers  \n",
       "9  Type of customer (Individual or Corporate)  "
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (d:Dimensions) RETURN d.dimension_id, d.dimension_name, d.dimension_values, d.dimension_description LIMIT 10;\")\n",
    "result.get_as_df()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.user_id</th>\n",
       "      <th>u.user_name</th>\n",
       "      <th>u.user_domain</th>\n",
       "      <th>u.user_theme</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>a</td>\n",
       "      <td>Sales</td>\n",
       "      <td>Maximise User Value</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>b</td>\n",
       "      <td>Sales</td>\n",
       "      <td>Maximise User Value</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>c</td>\n",
       "      <td>Sales</td>\n",
       "      <td>Maximise User Value</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>d</td>\n",
       "      <td>Sales</td>\n",
       "      <td>Maximise User Value</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>e</td>\n",
       "      <td>Marketing</td>\n",
       "      <td>Maximise customer lifetime value</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>6</td>\n",
       "      <td>f</td>\n",
       "      <td>Marketing</td>\n",
       "      <td>Increase Active customers</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  u.user_id u.user_name u.user_domain                      u.user_theme\n",
       "0         1           a         Sales               Maximise User Value\n",
       "1         2           b         Sales               Maximise User Value\n",
       "2         3           c         Sales               Maximise User Value\n",
       "3         4           d         Sales               Maximise User Value\n",
       "4         5           e     Marketing  Maximise customer lifetime value\n",
       "5         6           f     Marketing         Increase Active customers"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (u:User) RETURN u.user_id, u.user_name, u.user_domain, u.user_theme LIMIT 10;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>e1.entity_id</th>\n",
       "      <th>e2.entity_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CUSTOMER</td>\n",
       "      <td>SALES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>WAREHOUSE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>RETURN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SALES</td>\n",
       "      <td>PRODUCT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SUPPLIER</td>\n",
       "      <td>PRODUCT</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  e1.entity_id e2.entity_id\n",
       "0     CUSTOMER        SALES\n",
       "1      PRODUCT    WAREHOUSE\n",
       "2      PRODUCT       RETURN\n",
       "3        SALES      PRODUCT\n",
       "4     SUPPLIER      PRODUCT"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (e1:Entity)-[r:Relates_to]->(e2:Entity) RETURN e1.entity_id, e2.entity_id LIMIT 10;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>e.entity_id</th>\n",
       "      <th>m.metric_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CUSTOMER</td>\n",
       "      <td>CLTV</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SALES</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CUSTOMER</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CUSTOMER</td>\n",
       "      <td>ActiveCustomers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PRODUCT</td>\n",
       "      <td>BackOrderRatio</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>SALES</td>\n",
       "      <td>AOV</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>SALES</td>\n",
       "      <td>Revenue</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>WAREHOUSE</td>\n",
       "      <td>StockoutRate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>RETURN</td>\n",
       "      <td>AvgReturnAmt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>RETURN</td>\n",
       "      <td>ReturnRate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>SALES</td>\n",
       "      <td>Recency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>WAREHOUSE</td>\n",
       "      <td>AvgDeliveryVolume</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>WAREHOUSE</td>\n",
       "      <td>AvgDeliveryCost</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   e.entity_id        m.metric_id\n",
       "0     CUSTOMER               CLTV\n",
       "1        SALES  PurchaseFrequency\n",
       "2     CUSTOMER     ChurnRiskScore\n",
       "3     CUSTOMER    ActiveCustomers\n",
       "4      PRODUCT     BackOrderRatio\n",
       "5        SALES                AOV\n",
       "6        SALES            Revenue\n",
       "7    WAREHOUSE       StockoutRate\n",
       "8       RETURN       AvgReturnAmt\n",
       "9       RETURN         ReturnRate\n",
       "10       SALES            Recency\n",
       "11   WAREHOUSE  AvgDeliveryVolume\n",
       "12   WAREHOUSE    AvgDeliveryCost"
      ]
     },
     "execution_count": 83,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (e:Entity)-[r:Has_Metrics]->(m:Metrics) RETURN e.entity_id, m.metric_id;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>d.dimension_id</th>\n",
       "      <th>e.entity_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Region</td>\n",
       "      <td>SALES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SalesDate</td>\n",
       "      <td>SALES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>PaymentType</td>\n",
       "      <td>SALES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Color</td>\n",
       "      <td>PRODUCT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ProductCategory</td>\n",
       "      <td>PRODUCT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>ProductSubcategory</td>\n",
       "      <td>PRODUCT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Size</td>\n",
       "      <td>PRODUCT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>SupplierCountry</td>\n",
       "      <td>SUPPLIER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>SupplierName</td>\n",
       "      <td>SUPPLIER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Segment</td>\n",
       "      <td>CUSTOMER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Gender</td>\n",
       "      <td>CUSTOMER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>AgeGroup</td>\n",
       "      <td>CUSTOMER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>IncomeBracket</td>\n",
       "      <td>CUSTOMER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>ReturnDate</td>\n",
       "      <td>RETURN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>WarehouseLocation</td>\n",
       "      <td>WAREHOUSE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>StorageSection</td>\n",
       "      <td>WAREHOUSE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        d.dimension_id e.entity_id\n",
       "0               Region       SALES\n",
       "1            SalesDate       SALES\n",
       "2          PaymentType       SALES\n",
       "3                Color     PRODUCT\n",
       "4      ProductCategory     PRODUCT\n",
       "5   ProductSubcategory     PRODUCT\n",
       "6                 Size     PRODUCT\n",
       "7      SupplierCountry    SUPPLIER\n",
       "8         SupplierName    SUPPLIER\n",
       "9              Segment    CUSTOMER\n",
       "10              Gender    CUSTOMER\n",
       "11            AgeGroup    CUSTOMER\n",
       "12       IncomeBracket    CUSTOMER\n",
       "13          ReturnDate      RETURN\n",
       "14   WarehouseLocation   WAREHOUSE\n",
       "15      StorageSection   WAREHOUSE"
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (d:Dimensions)-[r:Belongs_to]->(e:Entity) RETURN d.dimension_id, e.entity_id;\")\n",
    "result.get_as_df()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>m1.metric_id</th>\n",
       "      <th>r.relationship</th>\n",
       "      <th>r.strength</th>\n",
       "      <th>m2.metric_id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CLTV</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>CLTV</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>AvgDeliveryVolume</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CLTV</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Strong</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CLTV</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>Recency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "      <td>Revenue</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Strong</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>ReturnRate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>Recency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>ActiveCustomers</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>Recency</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Strong</td>\n",
       "      <td>Revenue</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>ReturnRate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>BackOrderRatio</td>\n",
       "      <td>Negative</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>Revenue</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>BackOrderRatio</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>StockoutRate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>AOV</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "      <td>Revenue</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>AOV</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>AvgReturnAmt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>AOV</td>\n",
       "      <td>Positive</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>CLTV</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Revenue</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>AvgReturnAmt</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Revenue</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>AvgDeliveryCost</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>AvgReturnAmt</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "      <td>ReturnRate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>AvgDeliveryVolume</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "      <td>AvgDeliveryCost</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         m1.metric_id r.relationship r.strength       m2.metric_id\n",
       "0                CLTV         Direct     Strong  PurchaseFrequency\n",
       "1                CLTV         Direct   Moderate  AvgDeliveryVolume\n",
       "2                CLTV        Inverse     Strong     ChurnRiskScore\n",
       "3                CLTV         Direct   Moderate            Recency\n",
       "4   PurchaseFrequency         Direct     Strong            Revenue\n",
       "5   PurchaseFrequency        Inverse     Strong     ChurnRiskScore\n",
       "6   PurchaseFrequency         Direct   Moderate         ReturnRate\n",
       "7   PurchaseFrequency         Direct   Moderate            Recency\n",
       "8      ChurnRiskScore        Inverse   Moderate    ActiveCustomers\n",
       "9      ChurnRiskScore        Inverse   Moderate            Recency\n",
       "10     ChurnRiskScore        Inverse     Strong            Revenue\n",
       "11     ChurnRiskScore         Direct   Moderate         ReturnRate\n",
       "12     BackOrderRatio       Negative   Moderate            Revenue\n",
       "13     BackOrderRatio         Direct   Moderate       StockoutRate\n",
       "14                AOV         Direct     Strong            Revenue\n",
       "15                AOV         Direct   Moderate       AvgReturnAmt\n",
       "16                AOV       Positive   Moderate               CLTV\n",
       "17            Revenue        Inverse   Moderate       AvgReturnAmt\n",
       "18            Revenue         Direct   Moderate    AvgDeliveryCost\n",
       "19       AvgReturnAmt         Direct     Strong         ReturnRate\n",
       "20  AvgDeliveryVolume         Direct   Moderate    AvgDeliveryCost"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (m1:Metrics)-[r:Impacts]->(m2:Metrics) RETURN m1.metric_id,r.relationship, r.strength, m2.metric_id ;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>d.dimension_id</th>\n",
       "      <th>m.metric_id</th>\n",
       "      <th>r.relationship</th>\n",
       "      <th>r.strength</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Region</td>\n",
       "      <td>Revenue</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Region</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Moderate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SalesDate</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SalesDate</td>\n",
       "      <td>Recency</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PaymentType</td>\n",
       "      <td>AOV</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Color</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Weak</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Color</td>\n",
       "      <td>StockoutRate</td>\n",
       "      <td>Inverse</td>\n",
       "      <td>Weak</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>ProductCategory</td>\n",
       "      <td>StockoutRate</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Moderate</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>ProductCategory</td>\n",
       "      <td>Revenue</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ProductSubcategory</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>Direct</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       d.dimension_id        m.metric_id r.relationship r.strength\n",
       "0              Region            Revenue         Direct     Strong\n",
       "1              Region     ChurnRiskScore        Inverse   Moderate\n",
       "2           SalesDate  PurchaseFrequency         Direct     Strong\n",
       "3           SalesDate            Recency        Inverse     Strong\n",
       "4         PaymentType                AOV         Direct   Moderate\n",
       "5               Color  PurchaseFrequency         Direct       Weak\n",
       "6               Color       StockoutRate        Inverse       Weak\n",
       "7     ProductCategory       StockoutRate         Direct   Moderate\n",
       "8     ProductCategory            Revenue         Direct     Strong\n",
       "9  ProductSubcategory  PurchaseFrequency         Direct     Strong"
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (d:Dimensions)-[r:Drives]->(m:Metrics) RETURN d.dimension_id, m.metric_id, r.relationship, r.strength LIMIT 10;\")\n",
    "result.get_as_df()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u1.user_id</th>\n",
       "      <th>u2.user_id</th>\n",
       "      <th>r.similarity_strength</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>4</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5</td>\n",
       "      <td>6</td>\n",
       "      <td>Strong</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  u1.user_id u2.user_id r.similarity_strength\n",
       "0          1          2                Strong\n",
       "1          2          3                Strong\n",
       "2          3          4                Strong\n",
       "3          5          6                Strong"
      ]
     },
     "execution_count": 87,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (u1:User)-[r:Similar_to]->(u2:User) RETURN u1.user_id, u2.user_id, r.similarity_strength LIMIT 10;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 88,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>u.user_id</th>\n",
       "      <th>m.metric_id</th>\n",
       "      <th>r.Relationship</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Revenue</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>AOV</td>\n",
       "      <td>user_theme</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>user_theme</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>PurchaseFrequency</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>CLTV</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2</td>\n",
       "      <td>ReturnRate</td>\n",
       "      <td>user_theme</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2</td>\n",
       "      <td>StockoutRate</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2</td>\n",
       "      <td>BackOrderRatio</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2</td>\n",
       "      <td>ChurnRiskScore</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2</td>\n",
       "      <td>CLTV</td>\n",
       "      <td>user_domain</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  u.user_id        m.metric_id r.Relationship\n",
       "0         1            Revenue    user_domain\n",
       "1         1                AOV     user_theme\n",
       "2         1     ChurnRiskScore     user_theme\n",
       "3         1  PurchaseFrequency    user_domain\n",
       "4         1               CLTV    user_domain\n",
       "5         2         ReturnRate     user_theme\n",
       "6         2       StockoutRate    user_domain\n",
       "7         2     BackOrderRatio    user_domain\n",
       "8         2     ChurnRiskScore    user_domain\n",
       "9         2               CLTV    user_domain"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result = conn.execute(\"MATCH (u:User)-[r:Associated]->(m:Metrics) RETURN u.user_id, m.metric_id, r.Relationship LIMIT 10;\")\n",
    "result.get_as_df()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
